Revit 2027 API
FabricArea.MinorSheetAlignment Property
 The fabric sheet alignment in the fabric distribution in the minor direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricSheetAlignment MinorSheetAlignment { get; set; }
Public Property MinorSheetAlignment As FabricSheetAlignment
	Get
	Set
public:
property FabricSheetAlignment MinorSheetAlignment {
	FabricSheetAlignment get ();
	void set (FabricSheetAlignment value);
}
member MinorSheetAlignment : FabricSheetAlignment with get, set
Property Value
FabricSheetAlignment
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Remarks
 Changing the value of this property causes change of MinorLapSplice and LapSplicePosition properties if needed
See Also
Reference
FabricArea Class
Autodesk.Revit.DB.Structure Namespace